In [130]:
import pandas as pd

# Series

In [131]:
data = [1, 2, 3, 4, 5, 6, 7]

In [132]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [133]:
index = ["Linea" + str(i) for i in range(7)]
index

['Linea0', 'Linea1', 'Linea2', 'Linea3', 'Linea4', 'Linea5', 'Linea6']

In [134]:
s = pd.Series(data= data, index = index)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
Linea5    6
Linea6    7
dtype: int64

In [135]:
data = {"Linea" + str(i) : i +1 for i in range(7)}
data

{'Linea0': 1,
 'Linea1': 2,
 'Linea2': 3,
 'Linea3': 4,
 'Linea4': 5,
 'Linea5': 6,
 'Linea6': 7}

In [136]:
s = pd.Series(data)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
Linea5    6
Linea6    7
dtype: int64

In [137]:
s1 = s + 2
s1

Linea0    3
Linea1    4
Linea2    5
Linea3    6
Linea4    7
Linea5    8
Linea6    9
dtype: int64

In [138]:
s2 = s1 + s
s2

Linea0     4
Linea1     6
Linea2     8
Linea3    10
Linea4    12
Linea5    14
Linea6    16
dtype: int64

# DataFrame

In [139]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [140]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [141]:
index = ["Linea"+ str(i) for i in range(3)]
index

['Linea0', 'Linea1', 'Linea2']

In [142]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linea0  1  2  3
Linea1  4  5  6
Linea2  7  8  9

In [143]:
columns = ["columna"+ str(i) for i in range(3)]
columns

['columna0', 'columna1', 'columna2']

In [144]:
df1 = pd.DataFrame(data = data, index = index, columns= columns)
df1

        columna0  columna1  columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [145]:
data ={"columna0":{"Linea0": 1, "Linea1": 4, "Linea2": 7},
  "columna1":{"Linea0": 2, "Linea1": 5, "Linea2": 8},
  "columna2":{"Linea0":3, "Linea1": 6, "Linea2": 9}}
data

{'columna0': {'Linea0': 1, 'Linea1': 4, 'Linea2': 7},
 'columna1': {'Linea0': 2, 'Linea1': 5, 'Linea2': 8},
 'columna2': {'Linea0': 3, 'Linea1': 6, 'Linea2': 9}}

In [146]:
df2 = pd.DataFrame(data)
df2

        columna0  columna1  columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [147]:
data = [(1,2,3), (4, 5, 6),(7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [148]:
df3 = pd.DataFrame(data, index= index, columns=columns)
df3

        columna0  columna1  columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [149]:
df1[df1>0]="A"
df1

/tmp/ipykernel_14188/1762256164.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'A' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1[df1>0]="A"

       columna0 columna1 columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A

In [150]:
df2[df2>0]="B"
df2

/tmp/ipykernel_14188/484764680.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'B' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2[df2>0]="B"

       columna0 columna1 columna2
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B

In [151]:
df3[df3>0]="C"
df3

/tmp/ipykernel_14188/3473117151.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'C' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3[df3>0]="C"

       columna0 columna1 columna2
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [152]:
df4 = pd.concat([df1, df2, df3])
df4

       columna0 columna1 columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [153]:
df5 = pd.concat([df1, df2, df3], axis=1)
df5

,columna0,columna1,columna2,columna0,columna1,columna2,columna0,columna1,columna2
Linea0,A,A,A,B,B,B,C,C,C
Linea1,A,A,A,B,B,B,C,C,C
Linea2,A,A,A,B,B,B,C,C,C